sigma/rules/windows/network_connection/net_connection_win_addinutil_initiated.yml

Network Connection Initiated By AddinUtil.EXE

Attackers exploit trusted executables like addinutil.exe and msbuild.exe as LOLBins for proxy execution, bypassing security controls.
They inject malicious code or abuse insecure deserialization to execute commands, download payloads, and establish command-and-control (C2) connections.
By leveraging proxy execution, attackers evade detection and bypass application whitelisting. 
These binaries enable data exfiltration, lateral movement, and suspicious outbound connections to untrusted domains or IPs, mimicking legitimate process behavior.

MITIGATION --> Restrict execution of particularly vulnerable binaries to privileged accounts or groups that need to use it to lessen the opportunities for malicious usage
======================================================

SIGMA 

title: Network Connection Initiated By AddinUtil.EXE
id: 5205613d-2a63-4412-a895-3a2458b587b3
status: test
description: |
    Detects a network connection initiated by the Add-In deployment cache updating utility "AddInutil.exe".
    This could indicate a potential command and control communication as this tool doesn't usually initiate network activity.
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
date: 2023-09-18
modified: 2024-07-16
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        Initiated: 'true'
        Image|endswith: '\addinutil.exe'
    condition: selection
falsepositives:
    - Unknown
level: high
